#+TITLE:  Observations and drivers of the seasonal cycle of upper-ocean mixing in the Bay of Bengal
#+AUTHOR: D.A. Cherian, E.L. Shroyer, J.N. Moum
#+LATEX_CLASS: dcarticle
#+OPTIONS: toc:nil

#+BEGIN_EXPORT latex
\setcounter{tocdepth}{2}
\renewcommand{\contentsname}{}
\renewcommand{\bibsection}{}
\newcommand{\ML}{_\text{ML}}
\newcommand{\niw}{^\text{in}}
\newcommand{\wkb}{^\text{wkb}}
\newcommand{\note}[1]{\marginpar{\vspace{4em} \small \textit{#1}}}

\vspace{-5em}
\tableofcontents*
\newpage
\begin{abstract}
We describe the seasonal cycle of turbulent mixing in the top \SI{100}{m} of the Bay of Bengal as observed by moored mixing meters (χpods) during 2014 and 2015.
We combine all χpod observations to form seasonal-mean vertical profiles of diffusivity in the top 100m.
The seasonal cycle of near-surface turbulent diffusivity (top 45m) in the Bay appears to follow the seasonal cycle in wind forcing.
In the thermocline between \SI{50}{m} and \SI{100}{m}, we repeatedly find that high mixing events coincide with the passage of surface-forced downward propagating near-inertial waves and with the presence of enhanced low-frequency shear associated with the Summer Monsoon Current.
The months of March and April, a period of weak wind forcing and low near-inertial shear amplitude, are characterized by near-laminar flow and near-molecular temperature diffusivities for weeks at a time.
In the south-central Bay (8°N, 85°E --- 89°E), monthly averaged turbulent salt flux out of the salty Arabian Sea water between August and January can be significant relative to local $E-P$ and is of the right magnitude to make up the residual salt flux required by multiple model-based salt budgets for the upper Bay of Bengal.
\end{abstract}
#+END_EXPORT

#+NAME: paper1-prereqs
#+BEGIN_SRC ipython :session :exports none
import bay
import cartopy.crs as ccrs
import scikits.bootstrap as bs

bay = importlib.reload(bay)

if 'nrl4' not in locals():
    nrl4 = bay.read_nrl4()

* Appendix C: Tables of seasonal mean and seasonal median $K_T$

#+BEGIN_SRC emacs-lisp :eval export :results none :exports none
(setq ob-ipython-suppress-execution-count t)
(setq ob-ipython-show-mime-types nil)
#+END_SRC

#+BEGIN_SRC ipython :session :exports results :results replace output drawer :cache yes
import tabulate

# mmkt = bay.generate_mean_median_dataframe()
if 'mmkt' not in locals():
    mmkt = pd.read_csv('~/bay/estimates/mean_median_KT.csv')

meanKT = ((mmkt.pivot('bin', 'season', 'KT_mean') * 1e5)
          .reindex(['ML', 'BL'] + list(mmkt.bin.unique()[:-2])))

print('#+ATTR_LATEX: :align rrrrr')
print(r'#+CAPTION: Seasonal mean \(K_T\) (\SI{1e-5}{\m\square\per\s}) from Figure ref:fig:vert')
print(tabulate.tabulate(meanKT,
                        headers=['bin', 'NE', 'NESW', 'SW', 'SWNE'],
                        floatfmt='.2f',
                        tablefmt='orgtbl'))
#+END_SRC

#+RESULTS[8f8c7cc6e982539c95fbf92a794de58588997da7]:
:results:
#+ATTR_LATEX: :align rrrrr
#+CAPTION: Seasonal mean \(K_T\) (\SI{1e-5}{\m\squared\per\s}) from Figure ref:fig:vert
| bin              |    NE |   NESW |    SW |   SWNE |
|------------------+-------+--------+-------+--------|
| ML               | 85.41 |  22.72 | 50.12 |  11.54 |
| BL               | 43.79 |  48.28 | 42.83 |   6.99 |
| (1018.0, 1021.0] |  5.43 |   3.54 | 11.72 |   2.26 |
| (1021.0, 1022.0] | 19.64 |  14.19 |  8.53 |   2.49 |
| (1022.0, 1022.5] | 12.81 |   0.50 |  8.40 |  19.31 |
| (1022.5, 1023.0] |  2.99 |   0.23 |  5.14 |   3.88 |
| (1023.0, 1023.5] |  1.15 |   0.16 |  2.39 |   7.48 |
| (1023.5, 1024.2] |  0.58 |   0.06 |  2.04 |   0.83 |
| (1024.2, 1029.0] |  0.44 |   0.02 |  0.42 |   0.80 |

:end:

#+BEGIN_SRC ipython :session :exports results :results replace output drawer :cache yes
import tabulate

# mmkt = bay.generate_mean_median_dataframe()
if 'mmkt' not in locals():
    mmkt = pd.read_csv('~/bay/estimates/mean_median_KT.csv')

medianKT = ((mmkt.pivot('bin', 'season', 'KT_median') * 1e5)
            .reindex(['ML', 'BL'] + list(mmkt.bin.unique()[:-2])))

print('#+ATTR_LATEX: :align rrrrr')
print(r'#+CAPTION: Seasonal median \(K_T\) (\SI{1e-5}{\m\square\per\s}) from Figure ref:fig:vert')
print(tabulate.tabulate(medianKT,
                        headers=['bin', 'NE', 'NESW', 'SW', 'SWNE'],
                        floatfmt='.2f',
                        tablefmt='orgtbl'))
#+END_SRC

#+RESULTS[9c0717ddde379d10f21be51c32d478de54a56651]:
:results:
#+ATTR_LATEX: :align rrrrr
#+CAPTION: Seasonal median \(K_T\) (\SI{1e-5}{\m\square\per\s}) from Figure ref:fig:vert
| bin              |   NE | NESW |    SW | SWNE |
|------------------+------+------+-------+------|
| ML               | 7.67 | 1.13 | 12.68 | 2.42 |
| BL               | 2.43 | 1.72 |  6.50 | 0.93 |
| (1018.0, 1021.0] | 0.41 | 0.46 |  0.76 | 0.63 |
| (1021.0, 1022.0] | 1.44 | 0.85 |  0.73 | 0.42 |
| (1022.0, 1022.5] | 0.12 | 0.07 |  0.61 | 0.60 |
| (1022.5, 1023.0] | 0.05 | 0.04 |  0.52 | 0.99 |
| (1023.0, 1023.5] | 0.02 | 0.03 |  0.13 | 1.13 |
| (1023.5, 1024.2] | 0.02 | 0.02 |  0.09 | 0.02 |
| (1024.2, 1029.0] | 0.02 | 0.02 |  0.02 | 0.04 |

:end:

